## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8055916052)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 8 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * github_actions_variable.gcp_terraform_executor_service_account_email
  * github_actions_variable.gcp_terraform_planner_service_account_email
  * github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider
  * google_project_iam_member.terraform_planner_prow_project_browser
  * google_project_iam_member.terraform_planner_workloads_project_browser
  * google_service_account.terraform_planner
  * google_service_account_iam_binding.terraform_planner_workload_identity
* Update
  * google_service_account_iam_binding.terraform_workload_identity
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Replace
  * module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_pull_prod_plan"]



<details><summary>Change Result (Click me)</summary>

```hcl

  # github_actions_variable.gcp_terraform_executor_service_account_email will be created
  + resource "github_actions_variable" "gcp_terraform_executor_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "terraform-executor@sap-kyma-prow.iam.gserviceaccount.com"
      + variable_name = "gcp_terraform_executor_service_account_email"
    }

  # github_actions_variable.gcp_terraform_planner_service_account_email will be created
  + resource "github_actions_variable" "gcp_terraform_planner_service_account_email" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = (known after apply)
      + variable_name = "gcp_terraform_planner_service_account_email"
    }

  # github_actions_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider will be created
  + resource "github_actions_variable" "gh_com_kyma_project_gcp_workload_identity_federation_provider" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "test-infra"
      + updated_at    = (known after apply)
      + value         = "projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/providers/github-com-kyma-project"
      + variable_name = "gh_com_kyma_project_gcp_workload_identity_federation_provider"
    }

  # google_project_iam_member.terraform_planner_prow_project_browser will be created
  + resource "google_project_iam_member" "terraform_planner_prow_project_browser" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/browser"
    }

  # google_project_iam_member.terraform_planner_workloads_project_browser will be created
  + resource "google_project_iam_member" "terraform_planner_workloads_project_browser" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow-workloads"
      + role    = "roles/browser"
    }

  # google_service_account.terraform_planner will be created
  + resource "google_service_account" "terraform_planner" {
      + account_id   = "terraform-planner"
      + description  = "Identity of terraform planner"
      + disabled     = false
      + display_name = "terraform-planner"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_binding.terraform_planner_workload_identity will be created
  + resource "google_service_account_iam_binding" "terraform_planner_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform",
        ]
      + role               = "roles/workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_binding.terraform_workload_identity will be updated in-place
  ~ resource "google_service_account_iam_binding" "terraform_workload_identity" {
        id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
      ~ members            = [
          - "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
        # (12 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.gh_com_kyma_project_workload_identity_federation.google_service_account_iam_member.service_account["terraform_executor_pull_prod_plan"] must be replaced
-/+ resource "google_service_account_iam_member" "service_account" {
      ~ etag               = "BwYSSe/qN5o=" -> (known after apply)
      ~ id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform" -> (known after apply)
      ~ service_account_id = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 8 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-02-26T13:05:02.578309Z" -> "2024-02-26T18:15:25.394434Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
  ~ terraform_executor_gcp_workload_identity            = {
      ~ etag               = "BwYRy4Zgd4c=" -> "BwYSSe/qN5o="
        id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
      ~ members            = [
            "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Post Apply Prod Terraform",
          - "principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform",
        ]
        # (3 unchanged attributes hidden)
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # google_service_account_iam_binding.terraform_workload_identity has changed
  ~ resource "google_service_account_iam_binding" "terraform_workload_identity" {
      ~ etag               = "BwYRy4Zgd4c=" -> "BwYSSe/qN5o="
        id                 = "projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser"
        # (3 unchanged attributes hidden)
    }

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2024-02-26T14:43:33.314303Z" -> "2024-02-26T18:15:25.394434Z"
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":9965,"Program":"tfcmt","SHA1":"6658ab6adc347c05ed8323a84ed2ff94ec65128e","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->